Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum
The area support options.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_NONE
The "none" area support option.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_WALL_BOTTOM_PINNED
The area support simple.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_WALL_BOTTOM_FIXED
The wall bottom fixed area support.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_ALL_PINNED
The all pinned area support.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_ALL_FIXED
The all fixed area support.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_OUTLINE_PINNED
The outline pinned area support.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaSupportEnum.AREA_SUPPORT_OUTLINE_FIXED
The outline fixed area support.